app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
          <label class="col-3 form-controll">ジャンル</label>
          <%=f.collection_select:genre_id,Genre.all,:id,:name,prompt: "--選択してください--",class:"form-controll"%>