app/controllers/admin/customers_controller.rb

  def index
    @customers=Customer.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    @customer=Customer.find(params[:id])
    @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "postal_code" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["postal_code", "1234567"], ["updated_at", "2021-10-19 11:52:58.717791"], ["id", 1]]