app/controllers/admin/genres_controller.rb

  def index
    @genre=Genre.new
    @genres=Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @genre= Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "プリン"], ["created_at", "2021-10-11 02:47:43.830904"], ["updated_at", "2021-10-11 02:47:43.830904"]]

  def update
    @genre=Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ケーキ"], ["updated_at", "2021-10-11 02:47:58.813699"], ["id", 1]]