app/controllers/admin/items_controller.rb

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item=Item.new(item_params)
    @item.save

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items=Item.page(params[:page])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "name" = ?, "introduction" = ?, "price" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?
---
  def update
    @item=Item.find(params[:id])
    @item.update(item_params)