app/controllers/public/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @address=Address.new
    @addresses=Address.all

INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 2], ["name", "昭和キッド"], ["postal_code", "8888888"], ["address", "大阪府大阪市北区３丁目"], ["created_at", "2021-10-24 12:29:48.227371"], ["updated_at", "2021-10-24 12:29:48.227371"]]
---
  def create
    @address=Address.new(address_params)
    @address.customer_id=current_customer.id
    @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["name", "大正でもく"], ["updated_at", "2021-10-26 03:51:43.883857"], ["id", 3]]
---
  def update
    @address=Address.find(params[:id])
    @address.update(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]
---
  def destroy
    @address=Address.find(params[:id])
    @address.destroy