app/controllers/public/cart_items_controller.rb

  def index
    @cart_items=CartItem.all
---
SELECT "cart_items".* FROM "cart_items"

  def create
    @cart_item=CartItem.new(cart_item_params)
    @cart_item.customer_id=current_customer.id
    @item=Item.find(params[:cart_item][:item_id])
    @cart_item.item_id=@item.id
    @cart_item.save
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = ? LIMIT ?  [["item_id", 12], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 12], ["customer_id", 2], ["amount", 2], ["created_at", "2021-11-08 10:28:06.799627"], ["updated_at", "2021-11-08 10:28:06.799627"]]

  def update
    @cart_item=CartItem.find(params[:id])
    @cart_item.update(cart_item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 1], ["updated_at", "2021-10-28 12:01:08.525118"], ["id", 1]]

  def destroy
    @cart_item=CartItem.find(params[:id])
    @cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]