app/controllers/public/customers_controller.rb

UPDATE "customers" SET "postal_code" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["postal_code", "3456789"], ["updated_at", "2021-10-23 06:20:30.751319"], ["id", 2]]
---
  def update
    @customer=current_customer
    @customer.update(customer_params)

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2021-10-23 07:09:29.695695"], ["id", 2]]
---
  def quit
    @customer=current_customer
    @customer.is_active=params[:customer][:is_active]
    @customer.update(customer_params)