app/controllers/public/homes_controller.rb

  def top
    @items=Item.all
---
SELECT "items".* FROM "items" ORDER BY "items"."id" DESC