app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @items=Item.page(params[:page]).reverse_order.per(8)