app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirmation
    @order=Order.new(order_params)
    @order.order_items.build
    @cart_items=CartItem.where(customer_id: current_customer.id)

    if params[:order][:address_option] == "0"
      @order.name=current_customer.first_name + current_customer.last_name
      @order.postal_code=current_customer.postal_code
      @order.address=current_customer.address
    elsif params[:order][:address_option] == "1"
      @address=Address.find(params[:order][:address_id])

INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "billing_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items"
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def create
    @order=Order.new(order_params)
    @order.customer_id=current_customer.id
    @order.save
    current_customer.cart_items.each do |cart_item|
      @order_item=OrderItem.new
      @order_item.tax_included_price=cart_item.item.withTax
      @order_item.quantity=cart_item.amount
      @order_item.order_id=@order.id
      @order_item.item_id=cart_item.item_id
      @order_item.save
    end

    CartItem.destroy_all