app/controllers/public/orders_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def new
    @order=Order.new
    @customer=current_customer
    @addresses=Address.all

INSERT INTO "orders" ("customer_id", "postal_code", "name", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 2], ["postal_code", "1234567"], ["name", "平成道夫"], ["payment_method", 0], ["created_at", "2021-11-01 05:03:35.580376"], ["updated_at", "2021-11-01 05:03:35.580376"]]
---
  def create

    @order=Order.new(order_params)
    @order.customer_id=current_customer.id
    @order.save