app/views/public/orders/new.html.erb

SELECT "addresses".* FROM "addresses"
---
  <div class="row">
    <%= f.collection_select :address_full, @addresses.all,:id, 'full_address' %>