app/views/public/items/index.html.erb

SELECT COUNT(*) FROM "items"
---
    <p class="h3 font-weight-bold">商品一覧</p>
    <p class="text-left mt-2">（全<%=Item.count%>件）</p>